{"class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_6", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 8, 8, 1], "dtype": "float32", "name": "input_2", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_size": [9, 9], "filters": 64, "name": "conv2d_4", "dtype": "float32", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.001, "seed": null}}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0, "seed": null}}, "batch_input_shape": [null, 8, 8, 1], "activation": "relu", "padding": "same", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.001, "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0, "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"data_format": "channels_last", "activity_regularizer": null, "kernel_size": [5, 5], "filters": 1, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.001, "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0, "seed": null}}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}]}, "keras_version": "2.0.2"}