{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "sparse": false}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv2d_1", "padding": "same", "kernel_regularizer": null, "batch_input_shape": [null, 64, 64, 1], "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {"mean": 0.0, "stddev": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_size": [9, 9], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.001, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "trainable": true}, "class_name": "Conv2D"}, {"name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "conv2d_2", "padding": "same", "kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "bias_initializer": {"config": {"mean": 0.0, "stddev": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_size": [5, 5], "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.001, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "trainable": true}, "class_name": "Conv2D"}, {"name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "conv2d_3", "padding": "same", "kernel_regularizer": null, "filters": 1, "kernel_constraint": null, "bias_initializer": {"config": {"mean": 0.0, "stddev": 0.0, "seed": null}, "class_name": "RandomNormal"}, "kernel_size": [5, 5], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.001, "seed": null}, "class_name": "RandomNormal"}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "trainable": true}, "class_name": "Conv2D"}, {"name": "merge_1", "inbound_nodes": [[["input_1", 0, 0, {"mask": [null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null]}]]], "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "output_mask_type": "raw", "dot_axes": -1}, "class_name": "Merge"}]}, "keras_version": "2.0.2", "class_name": "Model"}