{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.0, "seed": null, "mean": 0.0}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.001, "seed": null, "mean": 0.0}}, "bias_regularizer": null, "kernel_size": [9, 9], "kernel_regularizer": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null, "use_bias": true, "activation": "relu", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "filters": 64, "activity_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.0, "seed": null, "mean": 0.0}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.001, "seed": null, "mean": 0.0}}, "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "activation": "linear", "trainable": true, "padding": "same", "data_format": "channels_last", "strides": [1, 1], "filters": 1, "activity_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.0, "seed": null, "mean": 0.0}}, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.001, "seed": null, "mean": 0.0}}, "bias_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"output_mask": null, "name": "merge_1", "output_shape_type": "raw", "concat_axis": -1, "mode": "sum", "output_shape": null, "output_mask_type": "raw", "mode_type": "raw", "dot_axes": -1, "arguments": {}}, "name": "merge_1", "inbound_nodes": [[["input_1", 0, 0, {"mask": [null, null]}], ["conv2d_3", 0, 0, {"mask": [null, null]}]]]}], "output_layers": [["merge_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.2"}